tutorials/RisingTaylorBubble/RisingTaylorBubbleSQChannelRun29/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  29.0                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdmfFTFoam;

startTime       latestTime;

stopAt          endTime;

endTime         6; 

deltaT          1.0e-6;

//writeControl    timeStep;
writeControl    adjustableRunTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression yes;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.15;
maxAlphaCo      0.15;

maxDeltaT       0.01;
dimensionSet    0;

functions
{
    bubbleRiseVelocity
    {
        type            coded;
        libs            ("libutilityFunctionObjects.so");
        writeControl    outputTime; //timeStep;
        //writeInterval   20;
        executeControl  outputTime; //timeStep;
        //executeInterval 20;
		enabled         yes;
/*
		code
        #{
            // Initialization - create empty file with header
            if (Pstream::master())  // Only master processor creates file
            {
                fileName outputPath("bubbleRiseVelocity.dat");
                OFstream riseFile(outputPath);
                riseFile << "# Time (s)\tVelocityZ (m/s)" << endl;
            }
        #};
*/
        codeExecute
        #{
            const volScalarField& alpha = mesh().lookupObject<volScalarField>("indicator");
            const volVectorField& U     = mesh().lookupObject<volVectorField>("U");
			const scalarField& vCell = mesh().V();

			// Calculate bubble velocity
            scalarField gasPhase(1.0 - alpha.internalField());
            scalar velZ = gSum(gasPhase * U.internalField().component(vector::Z) * vCell)
                        /(gSum(gasPhase * vCell) + VSMALL);
            scalar t = mesh().time().value();

         	// Append to file (master processor only)
            if (Pstream::master())
            {
                fileName outputPath("bubbleRiseVelocity.dat");
				OFstream riseFile
				(
					outputPath,
					IOstream::ASCII,           // format
					IOstream::currentVersion,  // version (note lowercase)
					IOstream::UNCOMPRESSED,    // compression
					true                       // append mode
				);

                riseFile << t << '\t' << velZ << endl;
            }

            //Info<< "Bubble rise velocity: " << velZ << " m/s" << endl;
        #};
    }
}

