tutorials/RisingTaylorBubble/RisingTaylorBubbleSQChannelRun29/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 0.211290e-03;
    rho             rho [1 -3 0 0 0 0 0] 1240;
}

air
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 0.0005;
    rho             rho [1 -3 0 0 0 0 0] 970;
}

sigma           sigma [1 0 -2 0 0 0 0] 28e-03;


// ************************************************************************* //
