tutorials/RisingTaylorBubble/RisingTaylorBubbleSQChannelRun29/0.org/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     29.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1240;

boundaryField
{
    inlet
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 1240;
    }

    outlet
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 1240;
    }

    walls
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 1240;
    }
}

// ************************************************************************* //
